Repository: meidan-it-ja-talous-oy/meita-documents-and-media
Catalog: src/languages/meita-documents-and-media-*.po
Languages: fi

source: Meita documents and media
fi: Meita dokumentit ja media

source: Documents and media block description
fi: Asiakirjojen ja mediatiedostojen lohko

source: Documents and media settings
fi: Dokumentit ja media asetukset

source: Default GCP Bucket API url
fi: Googlen tiedostopalvelun oletus URL osoite

source: GCP Bucket API url
fi: Googlen tiedostopalvelun URL osoite

source: Save Pattern
fi: Tallenna

source: Show bucket documents
fi: Googlen tiedostopalvelu

source: Wordpress plugin which collects documents from Google Bucket
fi: Lohko joka näyttää Googlen tiedostopalvelun (”Bucketin”) tiedostot

source: Settings
fi: Asetukset

source: Show media documents
fi: Mediatiedostot

source: Wordpress plugin which collects documents from Medialibrary
fi: Lohko, joka näyttää mediakirjaston mediatiedostoja

source: Modified
fi: Muokattu

source: Modified
fi: Muokattu

source: Download
fi: Lataa

source: Download
fi: Lataa

source: Previous
fi: Edellinen

source: Next
fi: Seuraava

source: Data source settings
fi: Asetukset

source: Google bucket URL
fi: URL -osoite

source: Select files to use
fi: Valitse näytettävät tiedostot

source: Choosing "Select files to use" you can choose which files you want to display.
fi: Avaa ’bucketin’ tiedostot josta voit valita tiedostot, jotka haluat näyttää.

source: Select files
fi: Valitse tiedostot

source: Select files to display
fi: Valitse tiedostot

source: Filter
fi: Suodata

source: Filter only selected
fi: Suodata valitut on/off

source: SAVE
fi: Tallenna

source: Information to display
fi: Näytettävät tiedot

source: Files
fi: Tiedosto

source: Folder
fi: Kansio

source: Open Media Library
fi: Avaa mediakirjasto

source: You have to have Filebirds ApiKey, if you want to browse folders!
fi: Sinulla tarvitsee olla Filebirdin Apiavain jotta voit selata kansioita!

source: Display settings
fi: Näyttöasetukset

source: Show icons
fi: Ikoni

source: Show date
fi: Päiväys

source: Show description
fi: Kuvaus

source: Show download link
fi: Lataa painike

source: Amount
fi: Tiedostojen määrä

source: Order
fi: Järjestys

source: Order by
fi: Järjestä

source: Title
fi: Nimen mukaan

source: Date
fi: Päiväyksen mukaan

source: Ascending
fi: Vanhin ensin

source: Descending
fi: Uusin ensin

source: Search files..
fi: Etsi tiedosto..

source: Search
fi: Etsi

source: Download file
fi: Lataa

source: Previous page
fi: Edellinen

source: Next page
fi: Seuraava

# block title
source: Dokumentit ja media - Google Bucket
fi: Dokumentit ja media -Dokumentit Googlen tiedostopalvelusta

# block description
source: Plugin that shows Google bucket files
fi: Lohko joka näyttää Googlen ”bucketin” tiedostot

# block title
source: Dokumentit ja media - Media files
fi: Dokumentit ja media - Mediatiedosto

# block description
source: This plugin shows medialibrary files and folders
fi: Lohko joka näyttää mediatiedostoja

source: Choose the ones you want to show
fi: Valitse näytettävät tiedot

source: Documents and media - Media files
fi: Dokumentit ja media - Mediatiedostot

source: Start by selecting a file or folder
fi: Valitse haluatko näyttää tietyt tiedostot vai koko kansion

source: Then you can adjust the display settings and change the order of the documents.
fi: Voit säätää mitä tietoja tiedostosta haluat näyttää ja muuttaa niiden järjestystä.

source: Documents and media - Google Bucket
fi: Documentit ja media - Googlen tiedostopalvelu

source: Open files and choose the ones you want
fi: Avaa tiedostot ja valitse haluamasi. Kun painat tallenna painiketta tiedostot tulevat ruudulle

source: Open file
fi: Avaa tiedosto

source: Remove selected
fi: Poista valinnat

source: Shows search bar and all files, you can change how many files you want to show
fi: Näyttää hakupalkin ja kaikki tiedostot, voit säätää näytettävien tiedostojen määrää

source: Page
fi: Sivu

source: Seach bar label text here
fi: Kirjoita hakuselite

source: Page %d
fi: Sivu %d

source: Page %d of %d
fi: Sivu %d / %d

source: Clear selected
fi: Tyhjennä valinnat

source: Clear filter
fi: Tyhjennä

source: Search files
fi: Etsi tiedostot

source: Choose folder
fi: Valitse kansio

source: Search button
fi: Haku painike

source: Search label text
fi: Haku painikkeen teksti

source: Hide label
fi: PIilota hakuselite

source: Show label
fi: Näytä hakuselite
